RhinoInside.Revit API Documentation
GeometryDecoder.ToCurves Method
 Converts the specified Autodesk.Revit.DB.CurveArray to an equivalent array of Rhino.Geometry.Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Rhino.Geometry.Curve[] ToCurves(
	this Autodesk.Revit.DB.CurveArray curveArray
)
@staticmethod
def ToCurves(
	curveArray: Autodesk.Revit.DB.CurveArray
) -> Array[Rhino.Geometry.Curve]
Parameters
curveArray
Type: Autodesk.Revit.DB.CurveArray
Revit curveArray to convert.
Return Value
Type: Rhino.Geometry.Curve[]
Rhino curve array that is equivalent to the provided Revit curveArray.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.CurveArray. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToCurves(CurveArray) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Curve[] rhinoCurves = revitCurveArray.ToCurves();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System import Array
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_curves = revit_curvearray.ToCurves() # type: RG.Array[Curve]
 Using ToCurves(CurveArray) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Curve[] rhinoCurves = GeometryEncoder.ToCurves(revitCurveArray)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System import Array
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_curve = GD.ToCurves(revit_curvearray) # type: RG.Array[Curve]
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace